In [2]:
import pandas as pd
y= pd.Period('2016')
y

Period('2016', 'A-DEC')

In [4]:
y.start_time

Timestamp('2016-01-01 00:00:00')

In [5]:
y.end_time

Timestamp('2016-12-31 23:59:59.999999999')

In [6]:
import pandas as pd
m= pd.Period('2016-1', freq ='M')
m

Period('2016-01', 'M')

In [7]:
m+1

Period('2016-02', 'M')

In [8]:
m-1

Period('2015-12', 'M')

In [13]:
h=pd.Period('2016-02-28 23:00', freq='H')
h

Period('2016-02-28 23:00', 'H')

In [14]:
h+2

Period('2016-02-29 01:00', 'H')

In [15]:
h.end_time

Timestamp('2016-02-28 23:59:59.999999999')

In [16]:
q=pd.Period('2017',freq='Q')
q

Period('2017Q1', 'Q-DEC')

In [17]:
q=pd.Period('2017Q1')
q

Period('2017Q1', 'Q-DEC')

In [18]:
q+1

Period('2017Q2', 'Q-DEC')

In [19]:
q.start_time

Timestamp('2017-01-01 00:00:00')

In [26]:
q=pd.Period('2017',freq='Q-JAN')
q

Period('2017Q4', 'Q-JAN')

In [27]:
q.start_time

Timestamp('2016-11-01 00:00:00')

In [28]:
q.end_time

Timestamp('2017-01-31 23:59:59.999999999')

In [37]:
idx = pd.period_range("2011","2015",freq='Q-JAN')
idx

PeriodIndex(['2011Q4', '2012Q1', '2012Q2', '2012Q3', '2012Q4', '2013Q1',
             '2013Q2', '2013Q3', '2013Q4', '2014Q1', '2014Q2', '2014Q3',
             '2014Q4', '2015Q1', '2015Q2', '2015Q3', '2015Q4'],
            dtype='period[Q-JAN]', freq='Q-JAN')

In [40]:
idx[0].start_time

Timestamp('2010-11-01 00:00:00')

In [41]:
idx[0].end_time

Timestamp('2011-01-31 23:59:59.999999999')

In [46]:
import pandas as pd
df = pd.read_csv('/Users/Shaheen/Desktop/Vineet/MS_SE_Spring2019/Python/Pandas/Day18_Wallmart.csv')
df.set_index('Line Item', inplace=True)
df

           2017Q1  2017Q2  2017Q3  2017Q4  2018Q1
Line Item
Revenue    115904  120854  118179  130936  117542
Expenses    86544   89485   87484   97743   87688
Profit      29360   31369   30695   33193   29854

In [45]:
df.T

Line Item  Revenue  Expenses  Profit
2017Q1      115904     86544   29360
2017Q2      120854     89485   31369
2017Q3      118179     87484   30695
2017Q4      130936     97743   33193
2018Q1      117542     87688   29854

In [60]:
df=df.T
df

Line Item  Revenue  Expenses  Profit
2017Q1      115904     86544   29360
2017Q2      120854     89485   31369
2017Q3      118179     87484   30695
2017Q4      130936     97743   33193
2018Q1      117542     87688   29854

In [63]:
df.index = pd.PeriodIndex(df.index, freq="Q-JAN")

In [64]:
df.index

PeriodIndex(['2017Q1', '2017Q2', '2017Q3', '2017Q4', '2018Q1'], dtype='period[Q-JAN]', freq='Q-JAN')

In [65]:

df.index[0].start_time

Timestamp('2016-02-01 00:00:00')

In [66]:
df["Start Date"]=df.index.map(lambda x: x.start_time)
df

Line Item  Revenue  Expenses  Profit Start Date
2017Q1      115904     86544   29360 2016-02-01
2017Q2      120854     89485   31369 2016-05-01
2017Q3      118179     87484   30695 2016-08-01
2017Q4      130936     97743   33193 2016-11-01
2018Q1      117542     87688   29854 2017-02-01

In [67]:

df["End Date"]=df.index.map(lambda x: x.end_time)
df

Line Item  Revenue  Expenses  Profit Start Date                      End Date
2017Q1      115904     86544   29360 2016-02-01 2016-04-30 23:59:59.999999999
2017Q2      120854     89485   31369 2016-05-01 2016-07-31 23:59:59.999999999
2017Q3      118179     87484   30695 2016-08-01 2016-10-31 23:59:59.999999999
2017Q4      130936     97743   33193 2016-11-01 2017-01-31 23:59:59.999999999
2018Q1      117542     87688   29854 2017-02-01 2017-04-30 23:59:59.999999999